## Import Library, mengambil, dan membaca data

In [139]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

data = pd.read_csv("Levels_Fyi_Salary_Data.csv")
data

,timestamp,company,level,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,tag,basesalary,...,Doctorate_Degree,Highschool,Some_College,Race_Asian,Race_White,Race_Two_Or_More,Race_Black,Race_Hispanic,Race,Education
0,6/7/2017 11:33:27,Oracle,L3,Product Manager,127000,"Redwood City, CA",1.5,1.5,NaN,107000.0,...,0,0,0,0,0,0,0,0,NaN,NaN
1,6/10/2017 17:11:29,eBay,SE 2,Software Engineer,100000,"San Francisco, CA",5.0,3.0,NaN,0.0,...,0,0,0,0,0,0,0,0,NaN,NaN
2,6/11/2017 14:53:57,Amazon,L7,Product Manager,310000,"Seattle, WA",8.0,0.0,NaN,155000.0,...,0,0,0,0,0,0,0,0,NaN,NaN
3,6/17/2017 0:23:14,Apple,M1,Software Engineering Manager,372000,"Sunnyvale, CA",7.0,5.0,NaN,157000.0,...,0,0,0,0,0,0,0,0,NaN,NaN
4,6/20/2017 10:58:51,Microsoft,60,Software Engineer,157000,"Mountain View, CA",5.0,3.0,NaN,0.0,...,0,0,0,0,0,0,0,0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
62637,9/9/2018 11:52:32,Google,T4,Software Engineer,327000,"Seattle, WA",10.0,1.0,Distributed Systems (Back-End),155000.0,...,0,0,0,0,0,0,0,0,NaN,NaN
62638,9/13/2018 8:23:32,Microsoft,62,Software Engineer,237000,"Redmond, WA",2.0,2.0,Full Stack,146900.0,...,0,0,0,0,0,0,0,0,NaN,NaN
62639,9/13/2018 14:35:59,MSFT,63,Software Engineer,220000,"Seattle, WA",14.0,12.0,Full Stack,157000.0,...,0,0,0,0,0,0,0,0,NaN,NaN
62640,9/16/2018 16:10:35,Salesforce,Lead MTS,Software Engineer,280000,"San Francisco, CA",8.0,4.0,iOS,194688.0,...,0,0,0,0,0,0,0,0,NaN,NaN
62641,1/29/2019 5:12:59,apple,ict3,Software Engineer,200000,"Sunnyvale, CA",0.0,0.0,ML / AI,155000.0,...,0,0,0,0,0,0,0,0,NaN,NaN

## Penjelasan data yang digunakan

Data yang kami gunakan adalah data mengenai gaji dari perusahaan terbaik dunia. <br>
Tujuan kami menggunakan data ini yaitu untuk mengetahui prospek pekerjaan dan gaji mengenai dunia teknologi yang selaras dengan fakultas STEI mengacu pada perusahaan besar global, sehingga diharapkan dapat memahami terkait gaji dan pekerjaan yang sedang banyak kuotanya. <br>
Sumber data kami adalah https://www.kaggle.com/datasets/jackogozaly/data-science-and-stem-salaries <br>
Data tersebut adalah hasil pengumpulan data oleh kaggle dari https://www.levels.fyi/?compare=Google,Facebook,Microsoft&track=Software%20Engineer . <br>
Data yang kami ambil berisi mengenai informasi tingkat pendidikan, kompensasi (gaji pokok, bonus, hibah saham),\
ras pekerja, dan lainnya.
format data kita adalah **csv** atau dengan nama lain "comma seperated values"\
ukuran filenya adalah 12,544 MB dengan
dimensi dan total elemen dari data kita adalah sebagai berikut :

### Jumlah Baris dan Kolom

In [166]:

print("Jumlah baris:", len(data))
print("Jumlah kolom:", len(data.columns))
    # menampilkan dimensi dari data
    # (baris,kolom)

Jumlah baris: 62642
Jumlah kolom: 29

### Jumlah Elemen Data

In [170]:
print("Total elemen data:", data.size)
    # menampilkan total elemen data

Total elemen data: 1816618

## Penjelasan atribut/kolom

Data kita mengandung kolom-kolom sebagai berikut

In [142]:
data.columns

Index(['timestamp', 'company', 'level', 'title', 'totalyearlycompensation',
       'location', 'yearsofexperience', 'yearsatcompany', 'tag', 'basesalary',
       'stockgrantvalue', 'bonus', 'gender', 'otherdetails', 'cityid', 'dmaid',
       'rowNumber', 'Masters_Degree', 'Bachelors_Degree', 'Doctorate_Degree',
       'Highschool', 'Some_College', 'Race_Asian', 'Race_White',
       'Race_Two_Or_More', 'Race_Black', 'Race_Hispanic', 'Race', 'Education'],
      dtype='object')

Data type dari setiap kolom adalah sebagai berikut

In [143]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62642 entries, 0 to 62641
Data columns (total 29 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   timestamp                62642 non-null  object
 1   company                  62637 non-null  object
 2   level                    62523 non-null  object
 3   title                    62642 non-null  object
 4   totalyearlycompensation  62642 non-null  int64
 5   location                 62642 non-null  object
 6   yearsofexperience        62642 non-null  float64
 7   yearsatcompany           62642 non-null  float64
 8   tag                      61788 non-null  object
 9   basesalary               62642 non-null  float64
 10  stockgrantvalue          62642 non-null  float64
 11  bonus                    62642 non-null  float64
 12  gender                   43102 non-null  object
 13  otherdetails             40137 non-null  object
 14  cityid                   62642 non-null  int64
 15  dmaid                    62640 non-null  float64
 16  rowNumber                62642 non-null  int64
 17  Masters_Degree           62642 non-null  int64
 18  Bachelors_Degree         62642 non-null  int64
 19  Doctorate_Degree         62642 non-null  int64
 20  Highschool               62642 non-null  int64
 21  Some_College             62642 non-null  int64
 22  Race_Asian               62642 non-null  int64
 23  Race_White               62642 non-null  int64
 24  Race_Two_Or_More         62642 non-null  int64
 25  Race_Black               62642 non-null  int64
 26  Race_Hispanic            62642 non-null  int64
 27  Race                     22427 non-null  object
 28  Education                30370 non-null  object
dtypes: float64(6), int64(13), object(10)
memory usage: 13.9+ MB

Tipe data yang terdapat pada tiap kolom bersifat sebagai berikut :
- Categorical - Ordinal : <br> 
totalyearlycompensation, cityid, rowNumber, Masters_Degree, Bachelors_Degree, Doctorate, Highschool, Some_College, Race_Asian, Race_White, Race_Two_Or_More, Race_Black, dan Race_Hispanic

- Categorical - Nominal : <br>
company, level, title, location, tag, gender, otherdetails, Race, dan Education

- Quantitative - Continues : <br>
timestamp

- Quantitative - Discrete : <br>
yearsofexperience, yearsatcompany, basesalary, stockgrantvalue, bonus, dan dmaid

Karakteristik - karakteristik yang terdapat pada kolom adalah sebagai berikut :
- Rank : terdiri dari angka yang 1 hingga 16600 dengan 1 adalah game dengan Global_Sales terbanyak dan angka terbesar adalah game dengan Global_Sales paling sedikit
- Name : Terdiri dari nama - nama game
- Platform : sistem yang digunakan untuk menjalankan game, data pada kolom ini terdiri dari:

In [144]:
data["company"].unique()

array(['Oracle', 'eBay', 'Amazon', ..., 'VmWare', 'SalesForce',
       'tableau software'], dtype=object)

In [145]:
data["level"].unique()

array(['L3', 'SE 2', 'L7', ..., 'L6 (Staff)', 'Mts 1',
       'Bioinformatics Scientist II'], dtype=object)

In [146]:
data["title"].unique()

array(['Product Manager', 'Software Engineer',
       'Software Engineering Manager', 'Data Scientist',
       'Solution Architect', 'Technical Program Manager',
       'Human Resources', 'Product Designer', 'Marketing',
       'Business Analyst', 'Hardware Engineer', 'Sales', 'Recruiter',
       'Mechanical Engineer', 'Management Consultant'], dtype=object)

In [147]:
min_year_fee = data["totalyearlycompensation"].min()
max_year_fee = data["totalyearlycompensation"].max()
print (str(min_year_fee),end= " - ")
print(str(max_year_fee),end = " ")
print("(dalam USD)")

10000 - 4980000 (dalam USD)

In [148]:
min_year_exp = data["yearsofexperience"].min()
max_year_exp = data["yearsofexperience"].max()
print (str(min_year_exp),end= " - ")
print(str(max_year_exp),end = " ")
print("(tahun)")

0.0 - 69.0 (tahun)

In [149]:
min_year_comp = data["yearsatcompany"].min()
max_year_comp = data["yearsatcompany"].max()
print (str(min_year_comp),end= " - ")
print(str(max_year_comp),end = " ")
print("(tahun)")

0.0 - 69.0 (tahun)

In [150]:
data["tag"].unique()

array([nan, 'Full Stack', 'Distributed Systems (Back-End)', ...,
       'Solution Mgt', 'Software Infra', 'Industry Cloud'], dtype=object)

In [151]:
min_base_salary = data["basesalary"].min()
max_base_salary = data["basesalary"].max()
print (str(min_base_salary),end= " - ")
print(str(max_base_salary),end = " ")
print("(USD)")

0.0 - 1659870.0 (USD)

In [152]:
min_stock_grant = data["stockgrantvalue"].min()
max_stock_grant = data["stockgrantvalue"].max()
print (str(min_stock_grant),end= " - ")
print(str(max_stock_grant),end = " ")
print("(USD)")

0.0 - 2800000.0 (USD)

In [153]:
min_bonus = data["bonus"].min()
max_bonus = data["bonus"].max()
print (str(min_bonus),end= " - ")
print(str(max_bonus),end = " ")
print("(USD)")

0.0 - 1000000.0 (USD)

In [154]:
print("Data pendidikan terdiri dari:\n",data["Education"].unique())
print("Dengan rincian: ")
print("Lulusan SMA:",data["Highschool"].sum(),"orang")
print("Magang:",data["Some_College"].sum(),"orang")
print("Lulusan S1:",data["Bachelors_Degree"].sum(),"orang")
print("Lulusan S2:",data["Masters_Degree"].sum(),"orang")
print("Lulusan S3:",data["Doctorate_Degree"].sum(),"orang")

Data pendidikan terdiri dari:
 [nan 'PhD' "Master's Degree" "Bachelor's Degree" 'Some College'
 'Highschool']
Dengan rincian:
Lulusan SMA: 320 orang
Magang: 355 orang
Lulusan S1: 12605 orang
Lulusan S2: 15391 orang
Lulusan S3: 1803 orang

In [155]:
print("Data ras terdiri dari: ",data["Race"].unique())
print("Dengan rincian: ")
print("Jumlah pekerja ras asia:", data["Race_Asian"].sum(),"orang")
print("Jumlah pekerja ras kulit putih:", data["Race_White"].sum(),"orang")
print("Jumlah pekerja ras kulit hitam:", data["Race_Black"].sum(),"orang")
print("Jumlah pekerja ras hispanic:", data["Race_Hispanic"].sum(),"orang")
print("Jumlah pekerja ras campuran:", data["Race_Two_Or_More"].sum(),"orang")

Data ras terdiri dari:  [nan 'White' 'Asian' 'Black' 'Two Or More' 'Hispanic']
Dengan rincian:
Jumlah pekerja ras asia: 11772 orang
Jumlah pekerja ras kulit putih: 8032 orang
Jumlah pekerja ras kulit hitam: 690 orang
Jumlah pekerja ras hispanic: 1130 orang
Jumlah pekerja ras campuran: 804 orang

## Presentase data kosong

In [156]:
x = (data.isna().sum().sum()/data.size)*100
print("{:.2f}%".format(x))

6.36%

### Mengecek null data

In [157]:
data.isna().sum()
    # mengecek kolom yang mengandung data null
    # kolom yang mengandung data null dalam data kita adalah

timestamp                      0
company                        5
level                        119
title                          0
totalyearlycompensation        0
location                       0
yearsofexperience              0
yearsatcompany                 0
tag                          854
basesalary                     0
stockgrantvalue                0
bonus                          0
gender                     19540
otherdetails               22505
cityid                         0
dmaid                          2
rowNumber                      0
Masters_Degree                 0
Bachelors_Degree               0
Doctorate_Degree               0
Highschool                     0
Some_College                   0
Race_Asian                     0
Race_White                     0
Race_Two_Or_More               0
Race_Black                     0
Race_Hispanic                  0
Race                       40215
Education                  32272
dtype: int64

In [158]:
list_NA_data = ["company","level","tag","gender","otherdetails","Race","Education"]
for i in list_NA_data:
    print("Persentase data error kolom",i,": {:.2f}%".format((data[i].isna().sum().sum()/data[i].size)*100))

Persentase data error kolom company : 0.01%
Persentase data error kolom level : 0.19%
Persentase data error kolom tag : 1.36%
Persentase data error kolom gender : 31.19%
Persentase data error kolom otherdetails : 35.93%
Persentase data error kolom Race : 64.20%
Persentase data error kolom Education : 51.52%

## Presentase data duplikat

## Data cleaning and Data Sample